app/Controllers/Reports.php

    public function view(string $reportId): string
    {
        $reportModel = new ReportConfigModel();
        $config      = $reportModel->findByReportId($reportId);

        if ($config === null) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound(
                "Report '{$reportId}' not found."
            );
        }

        $params   = ReportConfigModel::decodeParameters($config['parameters'] ?? null);
        $resolved = $this->resolveDrilldown($params);

        $rows        = [];
        $chartLabels = [];
        $chartValues = [];

        if (!$resolved['needsParam'] || $resolved['entity'] !== null) {
            $executor = new ReportExecutorService();
            $rows     = $executor->execute(
                $config['sql_query'],
                $resolved['needsParam'] ? [$resolved['placeholder'] => $resolved['entityId']] : []
            );
            $chartLabels = array_column($rows, $config['x_axis']);
            $chartValues = array_column($rows, $config['y_axis']);
        }

        return view('reports/view', [
            'config'      => $config,
            'rows'        => $rows,
            'chartLabels' => $chartLabels,
            'chartValues' => $chartValues,
            'reports'     => $reportModel->findAll(),
            'pageTitle'   => $config['title'],
            'needsParam'  => $resolved['needsParam'],
            'entityId'    => $resolved['entityId'],
            'entity'      => $resolved['entity'],
            'entityNoun'  => $resolved['entityNoun'],
            'entityLabel' => $resolved['entityLabel'],
            'entityDetail'=> $resolved['entityDetail'],
            'placeholder' => $resolved['placeholder'],
            'searchRoute' => $resolved['searchRoute'],
        ]);
---
SELECT *
FROM `report_configs`