app/Controllers/Reports.php

    public function view(string $reportId): string
    {
        $reportModel = new ReportConfigModel();
        $config      = $reportModel->findByReportId($reportId);

        if ($config === null) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound(
                "Report '{$reportId}' not found."
            );
        }

        $params         = ReportConfigModel::decodeParameters($config['parameters'] ?? null);
        $needsStudentId = in_array('student_id', $params, true);
        $studentId      = $needsStudentId ? (int) ($this->request->getGet('student_id') ?? 0) : 0;
        $student        = null;

        if ($needsStudentId && $studentId > 0) {
            $student = (new StudentModel())->find($studentId);
---
SELECT *
FROM `students`
WHERE `students`.`id` = 52