app/Models/ReportConfigModel.php

SELECT *
FROM `report_configs`
WHERE `report_id` = 'average_score_by_subject'
 LIMIT 1
---
    public function findByReportId(string $reportId): ?array
    {
        foreach ($this->findAll() as $row) {