app/Models/StudentModel.php

SELECT COUNT(*) AS `numrows` FROM `students`
---
    public function countTotal(): int
    {
        return (int) $this->countAll();

SELECT `id`, `first_name`, `last_name`, `email`
FROM `students`
WHERE   (
`first_name` LIKE 'd%' ESCAPE '!'
OR  `last_name` LIKE 'd%' ESCAPE '!'
 )
ORDER BY `last_name` ASC, `first_name` ASC
 LIMIT 20
---
    public function searchByName(string $q, int $limit = 20): array
    {
        $q = trim($q);
        if ($q === '') {
            return [];
        }

        return $this->select('id, first_name, last_name, email')
            ->groupStart()
                ->like('first_name', $q, 'after')
                ->orLike('last_name', $q, 'after')
            ->groupEnd()
            ->orderBy('last_name', 'ASC')
            ->orderBy('first_name', 'ASC')
            ->limit($limit)
            ->find();