app/Models/SubjectModel.php

SELECT COUNT(*) AS `numrows` FROM `subjects`
---
    public function countTotal(): int
    {
        return (int) $this->countAll();